<div style=" background-color: RGB(0,150,250);" >
<h1 style="margin: auto; padding: 20px 0; color:#fff; text-align: center">PROJET 6 DATA ANALYST</h1>
<h2 style="margin: auto; padding: 20px 0; color:#fff; text-align: center">Analyse des donn√©es de vente en ligne pour Lapage
</h2>
</div>

<div style="background-color: RGB(0,150,250);" >
<h2 style="margin: auto; padding: 20px; color:#fff; ">Etape 1 - Importation des librairies et chargement des fichiers</h2>
</div>

In [42]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import biblio_modules
import pyarrow

In [25]:
customers = pd.read_csv("../Source/customers.csv", sep=";")
products = pd.read_csv("../Source/products.csv", sep=";")
transactions = pd.read_csv("../Source/Transactions.csv", sep=";")

<div style="background-color: RGB(0,150,250);" >
<h2 style="margin: auto; padding: 20px; color:#fff; ">Etape 2 - Exploration fichier customers </h2>
</div>

In [26]:
customers.head()

  client_id sex  birth
0    c_4410   f   1967
1    c_7839   f   1975
2    c_1699   f   1984
3    c_5961   f   1962
4    c_5320   m   1943

In [27]:
products.head()

  id_prod  price  categ
0  0_1421  19.99      0
1  0_1368   5.13      0
2   0_731  17.99      0
3   1_587   4.99      1
4  0_1507   3.99      0

In [28]:
transactions.head()

  id_prod                        date session_id client_id
0  0_1259  2021-03-01 00:01:07.843138        s_1     c_329
1  0_1390  2021-03-01 00:02:26.047414        s_2     c_664
2  0_1352  2021-03-01 00:02:38.311413        s_3     c_580
3  0_1458  2021-03-01 00:04:54.559692        s_4    c_7912
4  0_1358  2021-03-01 00:05:18.801198        s_5    c_2033

<div style="background-color: RGB(0,150,250);" >
<h2 style="margin: auto; padding: 20px; color:#fff; ">Etape 5 - Fusion de product et transaction (OUTER JOIN) </h2>
</div>

In [36]:
display(transactions.head())
display(f"Les dimensions du dataframe sont {transactions.shape}")

  id_prod                        date session_id client_id
0  0_1259  2021-03-01 00:01:07.843138        s_1     c_329
1  0_1390  2021-03-01 00:02:26.047414        s_2     c_664
2  0_1352  2021-03-01 00:02:38.311413        s_3     c_580
3  0_1458  2021-03-01 00:04:54.559692        s_4    c_7912
4  0_1358  2021-03-01 00:05:18.801198        s_5    c_2033

'Les dimensions du dataframe sont (687534, 4)'

In [38]:
df_transaction_product = pd.merge(transactions, products, how='outer', on='id_prod')
df_transaction_product
#Il y a des r√©f√©rence produits quui ne sont pas pr√©sentes

       id_prod                        date session_id client_id  price  categ
0          0_0  2021-03-01 13:45:51.575117      s_282    c_5152   3.75      0
1          0_0  2021-03-02 06:42:55.351333      s_621    c_2917   3.75      0
2          0_0  2021-03-02 18:49:49.651862      s_852    c_3988   3.75      0
3          0_0  2021-03-02 21:57:33.862118      s_908    c_1004   3.75      0
4          0_0  2021-03-03 23:59:48.997483     s_1379     c_278   3.75      0
...        ...                         ...        ...       ...    ...    ...
687550    2_99  2022-05-21 01:53:46.967570   s_211661    c_5828  84.99      2
687551    2_99  2022-07-21 01:53:46.967570   s_241374    c_5828  84.99      2
687552    2_99  2022-11-11 20:56:49.820935   s_296127    c_7135  84.99      2
687553    2_99  2022-12-11 20:56:49.820935   s_310606    c_7135  84.99      2
687554    2_99  2023-01-21 01:53:46.967570   s_329932    c_5828  84.99      2

[687555 rows x 6 columns]

In [39]:
df_transaction_product.isna().sum()

id_prod        0
date          21
session_id    21
client_id     21
price          0
categ          0
dtype: int64

In [41]:
df_transaction_product.loc[df_transaction_product['session_id'].isna()]

       id_prod date session_id client_id   price  categ
6073    0_1014  NaN        NaN       NaN    1.15      0
6511    0_1016  NaN        NaN       NaN   35.06      0
8723    0_1025  NaN        NaN       NaN   24.99      0
21687   0_1062  NaN        NaN       NaN   20.08      0
40971   0_1119  NaN        NaN       NaN    2.99      0
94245   0_1318  NaN        NaN       NaN   20.92      0
297077  0_1620  NaN        NaN       NaN    0.80      0
299185  0_1624  NaN        NaN       NaN   24.50      0
311123  0_1645  NaN        NaN       NaN    2.99      0
323013  0_1780  NaN        NaN       NaN    1.67      0
325137  0_1800  NaN        NaN       NaN   22.05      0
387651  0_2308  NaN        NaN       NaN   20.28      0
389726   0_299  NaN        NaN       NaN   22.99      0
390221   0_310  NaN        NaN       NaN    1.94      0
390689   0_322  NaN        NaN       NaN    2.99      0
397070   0_510  NaN        NaN       NaN   23.66      0
415475     1_0  NaN        NaN       NaN   31.82      1
514820   1_394  NaN        NaN       NaN   39.73      1
685998    2_72  NaN        NaN       NaN  141.32      2
686501    2_86  NaN        NaN       NaN  132.36      2
686502    2_87  NaN        NaN       NaN  220.99      2

In [44]:
#df_transaction_product.to_csv("../Source/Data_processed/Table_merged.csv", index=False, sep=";")

<div style="background-color: RGB(900,80,50);" >
<h3 style="margin: auto; padding: 10px; color:#fff; "> Partie 1 - Analyse des indicateurs de vente </h2>
</div>